In [1]:
import pandas as pd
import numpy as np

# D1

Q1 (01Dec2024)

In [6]:
df = pd.read_csv('data.csv', header=None)

In [7]:
df

                 0
0    76569   66648
1    38663   66530
2    60350   60777
3    35330   13469
4    88681   66648
..             ...
995  76809   13023
996  56403   10503
997  23533   40965
998  82416   74888
999  24373   20896

[1000 rows x 1 columns]

In [12]:
df[['number1', 'number2']] = df[0].str.split(expand=True)

In [13]:
df

                 0 number1 number2
0    76569   66648   76569   66648
1    38663   66530   38663   66530
2    60350   60777   60350   60777
3    35330   13469   35330   13469
4    88681   66648   88681   66648
..             ...     ...     ...
995  76809   13023   76809   13023
996  56403   10503   56403   10503
997  23533   40965   23533   40965
998  82416   74888   82416   74888
999  24373   20896   24373   20896

[1000 rows x 3 columns]

In [46]:
df_sorted1 = df.sort_values(by='number1', ascending=True)
df1 = df_sorted1.drop(columns=[0, 'number2'])
df1 = df1['number1'].reset_index(drop=True)

df_sorted2 = df.sort_values(by='number2', ascending=True)
df2 = df_sorted2.drop(columns=[0, 'number1'])
df2 = df2['number2'].reset_index(drop=True)

In [49]:
df_combined = pd.concat([df1, df2], axis=1)
df_combined

    number1 number2
0     10053   10004
1     10073   10076
2     10269   10099
3     10341   10197
4     10463   10480
..      ...     ...
995   99405   98917
996   99530   99015
997   99574   99652
998   99634   99767
999   99877   99853

[1000 rows x 2 columns]

In [47]:
sum=0
for i in range(0, len(df)):
    x=int (df1[i])-int (df2[i])
    if (x<0):
        x=x*(-1)
    sum=sum+x

In [48]:
sum

3246517

Q2 （01Dec2024)

In [51]:
sum2=0
for i in range(0, len(df)):
    for j in range(0, len(df)):
        count=0
        if (df2[j] == df1[i]):
            count+=1
        sum2=sum2+int (df1[i])*count

In [52]:
sum2

29379307

# D2

Q1 (02Dec2024)

In [5]:
dfd2 = pd.read_csv('Day2Data.csv', header=None)
dfd2

                           0
0       40 42 44 47 49 50 48
1       65 67 70 71 72 75 75
2    74 76 78 81 83 85 87 91
3    73 76 79 81 82 85 86 91
4       64 67 69 70 68 71 72
..                       ...
995           56 59 61 64 65
996     49 48 45 44 42 40 38
997        66 65 63 60 58 56
998     38 41 43 44 47 50 53
999                2 3 4 6 9

[1000 rows x 1 columns]

In [20]:
count = 0
for i in range(len(dfd2)):
    numbers = list(map(int, dfd2.iloc[i][0].split()))
    safe = True
    acs = sorted(numbers)
    dsc = sorted(numbers, reverse=True)
    if numbers == acs or numbers == dsc:
        for j in range(len(numbers) - 1):
            diff = numbers[j + 1] - numbers[j]
            if -3 <= diff <= -1 or 1 <= diff <= 3:
                continue
            else:
                safe = False
                break
    else:
        safe = False

    if safe:
        dfd2['safe'][i] = True
        count += 1
    else:
        dfd2['safe'][i] = False

count

C:\Users\Hsuen\AppData\Local\Temp\ipykernel_33984\263813454.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfd2['safe'][i] = False
C:\Users\Hsuen\AppData\Local\Temp\ipykernel_33984\263813454.py:19: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dfd2['safe'][i] = True

486

In [21]:
print(dfd2[dfd2['safe']==False])

                           0   safe
0       40 42 44 47 49 50 48  False
1       65 67 70 71 72 75 75  False
2    74 76 78 81 83 85 87 91  False
3    73 76 79 81 82 85 86 91  False
4       64 67 69 70 68 71 72  False
..                       ...    ...
509           13 17 21 22 27  False
510     78 71 70 67 65 60 57  False
511        54 56 54 52 51 49  False
512  47 53 54 55 56 57 58 65  False
513     48 48 46 45 44 40 41  False

[514 rows x 2 columns]

Q2 (02Dec2024)

In [22]:
count2 = 0
for i in range(len(dfd2)):
    if (dfd2['safe'][i]==False):
        numbers = list(map(int, dfd2.iloc[i][0].split()))
        
        for j in range(len(numbers)):
            new_numbers = numbers.copy()
            new_numbers.remove(new_numbers[j])
            safe = True
            acs = sorted(new_numbers)
            dsc = sorted(new_numbers, reverse=True)
            if new_numbers == acs or new_numbers == dsc:
                for k in range(len(new_numbers) - 1):
                    diff = new_numbers[k + 1] - new_numbers[k]
                    if -3 <= diff <= -1 or 1 <= diff <= 3:
                        continue
                    else:
                        safe = False
                        break
            else:
                safe = False
                
            if safe:
                count2 += 1
                break
count2

54

In [24]:
count+count2

540